{"class_name": "Functional", "config": {"name": "model_5", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "weight"}, "name": "weight", "inbound_nodes": []}, {"class_name": "QDense", "config": {"name": "weight_1", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "QInitializer", "config": {"initializer": {"class_name": "LecunNormal", "config": {"seed": null}, "__passive_serialization__": true, "shared_object_id": 3}, "use_scale": true, "quantizer": {"class_name": "quantized_bits", "config": {"bits": 13, "integer": 3, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 1, "__passive_serialization__": true}}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-06, "l2": 1.000000013351432e-10}, "shared_object_id": 6}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "Clip", "config": {"min_value": -8.0, "max_value": 8.0}, "shared_object_id": 7}, "bias_constraint": {"class_name": "Clip", "config": {"min_value": -2.0, "max_value": 2.0}, "shared_object_id": 8}, "kernel_quantizer": {"class_name": "quantized_bits", "config": {"bits": 13, "integer": 3, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 1, "__passive_serialization__": true}, "bias_quantizer": {"class_name": "quantized_bits", "config": {"bits": 10, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}}, "kernel_range": null, "bias_range": null}, "name": "weight_1", "inbound_nodes": [[["weight", 0, 0, {}]]]}, {"class_name": "QActivation", "config": {"name": "q_activation", "trainable": true, "dtype": "float32", "activation": "quantized_relu(14,3)"}, "name": "q_activation", "inbound_nodes": [[["weight_1", 0, 0, {}]]]}, {"class_name": "QDense", "config": {"name": "weight_2", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "QInitializer", "config": {"initializer": {"class_name": "LecunNormal", "config": {"seed": null}, "__passive_serialization__": true, "shared_object_id": 13}, "use_scale": true, "quantizer": {"class_name": "quantized_bits", "config": {"bits": 10, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 11, "__passive_serialization__": true}}, "shared_object_id": 14}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 15}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-06, "l2": 1.000000013351432e-10}, "shared_object_id": 16}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "Clip", "config": {"min_value": -2.0, "max_value": 2.0}, "shared_object_id": 17}, "bias_constraint": {"class_name": "Clip", "config": {"min_value": -2.0, "max_value": 2.0}, "shared_object_id": 18}, "kernel_quantizer": {"class_name": "quantized_bits", "config": {"bits": 10, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 11, "__passive_serialization__": true}, "bias_quantizer": {"class_name": "quantized_bits", "config": {"bits": 10, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}}, "kernel_range": null, "bias_range": null}, "name": "weight_2", "inbound_nodes": [[["q_activation", 0, 0, {}]]]}, {"class_name": "QActivation", "config": {"name": "q_activation_1", "trainable": true, "dtype": "float32", "activation": "quantized_relu(14,3)"}, "name": "q_activation_1", "inbound_nodes": [[["weight_2", 0, 0, {}]]]}, {"class_name": "QDense", "config": {"name": "weight_final", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "QInitializer", "config": {"initializer": {"class_name": "LecunNormal", "config": {"seed": null}, "__passive_serialization__": true, "shared_object_id": 23}, "use_scale": true, "quantizer": {"class_name": "quantized_bits", "config": {"bits": 6, "integer": 2, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 21, "__passive_serialization__": true}}, "shared_object_id": 24}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 25}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-06, "l2": 1.000000013351432e-10}, "shared_object_id": 26}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "Clip", "config": {"min_value": -4.0, "max_value": 4.0}, "shared_object_id": 27}, "bias_constraint": {"class_name": "Clip", "config": {"min_value": -2.0, "max_value": 2.0}, "shared_object_id": 28}, "kernel_quantizer": {"class_name": "quantized_bits", "config": {"bits": 6, "integer": 2, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 21, "__passive_serialization__": true}, "bias_quantizer": {"class_name": "quantized_bits", "config": {"bits": 10, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}}, "kernel_range": null, "bias_range": null}, "name": "weight_final", "inbound_nodes": [[["q_activation_1", 0, 0, {}]]]}, {"class_name": "QActivation", "config": {"name": "q_activation_2", "trainable": true, "dtype": "float32", "activation": "quantized_relu(9,1)"}, "name": "q_activation_2", "inbound_nodes": [[["weight_final", 0, 0, {}]]]}], "input_layers": [["weight", 0, 0]], "output_layers": [["q_activation_2", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}