{"class_name": "Functional", "config": {"name": "model_7", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 6], "dtype": "float32", "sparse": false, "ragged": false, "name": "assoc"}, "name": "assoc", "inbound_nodes": []}, {"class_name": "QDense", "config": {"name": "association_0", "trainable": true, "dtype": "float32", "units": 20, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "QInitializer", "config": {"initializer": {"class_name": "LecunNormal", "config": {"seed": null}, "__passive_serialization__": true, "shared_object_id": 3}, "use_scale": true, "quantizer": {"class_name": "quantized_bits", "config": {"bits": 16, "integer": 4, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 1, "__passive_serialization__": true}}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-06, "l2": 1.000000013351432e-10}, "shared_object_id": 6}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "Clip", "config": {"min_value": -16.0, "max_value": 16.0}, "shared_object_id": 7}, "bias_constraint": {"class_name": "Clip", "config": {"min_value": -2.0, "max_value": 2.0}, "shared_object_id": 8}, "kernel_quantizer": {"class_name": "quantized_bits", "config": {"bits": 16, "integer": 4, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 1, "__passive_serialization__": true}, "bias_quantizer": {"class_name": "quantized_bits", "config": {"bits": 7, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}}, "kernel_range": null, "bias_range": null}, "name": "association_0", "inbound_nodes": [[["assoc", 0, 0, {}]]]}, {"class_name": "QActivation", "config": {"name": "q_activation_4", "trainable": true, "dtype": "float32", "activation": "quantized_relu(14,3)"}, "name": "q_activation_4", "inbound_nodes": [[["association_0", 0, 0, {}]]]}, {"class_name": "QDense", "config": {"name": "association_1", "trainable": true, "dtype": "float32", "units": 20, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "QInitializer", "config": {"initializer": {"class_name": "LecunNormal", "config": {"seed": null}, "__passive_serialization__": true, "shared_object_id": 13}, "use_scale": true, "quantizer": {"class_name": "quantized_bits", "config": {"bits": 17, "integer": 3, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 11, "__passive_serialization__": true}}, "shared_object_id": 14}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 15}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-06, "l2": 1.000000013351432e-10}, "shared_object_id": 16}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "Clip", "config": {"min_value": -8.0, "max_value": 8.0}, "shared_object_id": 17}, "bias_constraint": {"class_name": "Clip", "config": {"min_value": -2.0, "max_value": 2.0}, "shared_object_id": 18}, "kernel_quantizer": {"class_name": "quantized_bits", "config": {"bits": 17, "integer": 3, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 11, "__passive_serialization__": true}, "bias_quantizer": {"class_name": "quantized_bits", "config": {"bits": 12, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}}, "kernel_range": null, "bias_range": null}, "name": "association_1", "inbound_nodes": [[["q_activation_4", 0, 0, {}]]]}, {"class_name": "QActivation", "config": {"name": "q_activation_5", "trainable": true, "dtype": "float32", "activation": "quantized_relu(13,3)"}, "name": "q_activation_5", "inbound_nodes": [[["association_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "association_final", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "LecunNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 1.000000013351432e-10}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "association_final", "inbound_nodes": [[["q_activation_5", 0, 0, {}]]]}], "input_layers": [["assoc", 0, 0]], "output_layers": [["association_final", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}