{"class_name": "Functional", "config": {"name": "model_6", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "hist"}, "name": "hist", "inbound_nodes": []}, {"class_name": "QConv1D", "config": {"name": "pattern_1", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "QInitializer", "config": {"initializer": {"class_name": "HeNormal", "config": {"seed": null}, "__passive_serialization__": true}, "use_scale": true, "quantizer": {"class_name": "quantized_bits", "config": {"bits": 5, "integer": 2, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 1, "__passive_serialization__": true}}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "Clip", "config": {"min_value": -4.0, "max_value": 4.0}}, "bias_constraint": null, "kernel_quantizer": {"class_name": "quantized_bits", "config": {"bits": 5, "integer": 2, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 1, "__passive_serialization__": true}, "bias_quantizer": null, "kernel_range": null, "bias_range": null}, "name": "pattern_1", "inbound_nodes": [[["hist", 0, 0, {}]]]}, {"class_name": "QActivation", "config": {"name": "q_activation_3", "trainable": true, "dtype": "float32", "activation": "quantized_relu(8,2)"}, "name": "q_activation_3", "inbound_nodes": [[["pattern_1", 0, 0, {}]]]}], "input_layers": [["hist", 0, 0]], "output_layers": [["q_activation_3", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}